In [1]:
import pandas as pd
import numpy as np

In [2]:
demographics = pd.read_excel("./Data/Customer_Demographics.xlsx")

In [3]:
demographics.head()

,Customer_ID,Territory,Nationality,Income_Range,Job_Type,Marital_Status,Gender,State,Language,Loyalty_Status,Birth_date,Age,Points,First_txn_dt,Last_accr_txn_dt,Last_rdm_txn_dt
0,1800000006365760,United Arab Emirates,INDIA,Below 5000,Services,Married,M,Abu Dhabi,English,Gold,01JUN1959:00:00:00,59.0,814.0,02NOV2010:00:00:00,27SEP2018:21:45:25,11MAR2018:19:11:57
1,1800000006365820,United Arab Emirates,UNITED ARAB EMIRATES,Below 5000,Services,Married,F,Abu Dhabi,Arabic,Silver,01JAN1900:00:00:00,NaN,212.0,06DEC2010:00:00:00,16AUG2016:21:08:28,16MAR2015:13:39:12
2,1800000006366060,United Arab Emirates,SRI LANKA,Below 5000,Services,Married,M,Abu Dhabi,English,Silver,07JUN1959:00:00:00,59.0,186.0,17FEB2011:00:00:00,31AUG2018:20:52:18,30JAN2017:19:19:19
3,1800000006366230,United Arab Emirates,JORDAN,Below 5000,Services,Married,F,Abu Dhabi,Arabic,Silver,21JAN1962:00:00:00,57.0,126.0,30OCT2010:00:00:00,30JUL2018:20:30:05,20JUN2017:17:57:27
4,1800000006366570,United Arab Emirates,OCCUPIED PALESTINIAN TERRITORY,Below 5000,Services,Married,M,Abu Dhabi,Arabic,Silver,01JAN1900:00:00:00,NaN,197.0,10NOV2010:00:00:00,03SEP2018:22:10:56,17JUN2017:23:08:28

In [4]:
demographics.shape

(100000, 16)

In [5]:
demographics.Territory.value_counts()

United Arab Emirates    100000
Name: Territory, dtype: int64

In [6]:
demographics = demographics.drop(["Territory", "Birth_date", "First_txn_dt", "Last_accr_txn_dt", "Last_rdm_txn_dt"], axis = 1)

In [7]:
demographics.head()

,Customer_ID,Nationality,Income_Range,Job_Type,Marital_Status,Gender,State,Language,Loyalty_Status,Age,Points
0,1800000006365760,INDIA,Below 5000,Services,Married,M,Abu Dhabi,English,Gold,59.0,814.0
1,1800000006365820,UNITED ARAB EMIRATES,Below 5000,Services,Married,F,Abu Dhabi,Arabic,Silver,NaN,212.0
2,1800000006366060,SRI LANKA,Below 5000,Services,Married,M,Abu Dhabi,English,Silver,59.0,186.0
3,1800000006366230,JORDAN,Below 5000,Services,Married,F,Abu Dhabi,Arabic,Silver,57.0,126.0
4,1800000006366570,OCCUPIED PALESTINIAN TERRITORY,Below 5000,Services,Married,M,Abu Dhabi,Arabic,Silver,NaN,197.0

In [8]:
demographics.isnull().sum()

Customer_ID           0
Nationality           0
Income_Range          0
Job_Type              0
Marital_Status        0
Gender                0
State                 0
Language              0
Loyalty_Status        0
Age               26096
Points             2863
dtype: int64

In [9]:
demographics["Age"].median()

36.0

In [10]:
demographics.fillna(demographics["Age"].median(), inplace = True)

In [11]:
from sklearn.preprocessing import LabelEncoder

In [12]:
le = LabelEncoder()

In [13]:
demographics["Nationality"] = le.fit_transform(demographics["Nationality"])

In [14]:
demographics.head()

,Customer_ID,Nationality,Income_Range,Job_Type,Marital_Status,Gender,State,Language,Loyalty_Status,Age,Points
0,1800000006365760,88,Below 5000,Services,Married,M,Abu Dhabi,English,Gold,59.0,814.0
1,1800000006365820,206,Below 5000,Services,Married,F,Abu Dhabi,Arabic,Silver,36.0,212.0
2,1800000006366060,182,Below 5000,Services,Married,M,Abu Dhabi,English,Silver,59.0,186.0
3,1800000006366230,97,Below 5000,Services,Married,F,Abu Dhabi,Arabic,Silver,57.0,126.0
4,1800000006366570,143,Below 5000,Services,Married,M,Abu Dhabi,Arabic,Silver,36.0,197.0

In [15]:
demographics["Income_Range"] = le.fit_transform(demographics["Income_Range"])

In [16]:
demographics.Marital_Status.value_counts()

Unspecified    92484
Married         6522
Single           982
Widowed            5
Divorsed           4
Separated          2
Others             1
Name: Marital_Status, dtype: int64

In [17]:
demographics["Marital_Status"] = le.fit_transform(demographics["Marital_Status"])

In [18]:
demographics.Gender.value_counts()

M              52524
F              46063
Unspecified     1413
Name: Gender, dtype: int64

In [19]:
demographics["Gender"] = le.fit_transform(demographics["Gender"])

In [20]:
demographics["State"] = le.fit_transform(demographics["State"])
demographics["Language"] = le.fit_transform(demographics["Language"])
demographics["Loyalty_Status"] = le.fit_transform(demographics["Loyalty_Status"])
demographics["Services"] = le.fit_transform(demographics["Loyalty_Status"])

In [21]:
demographics.head()

,Customer_ID,Nationality,Income_Range,Job_Type,Marital_Status,Gender,State,Language,Loyalty_Status,Age,Points
0,1800000006365760,88,4,Services,1,1,0,1,0,59.0,814.0
1,1800000006365820,206,4,Services,1,0,0,0,1,36.0,212.0
2,1800000006366060,182,4,Services,1,1,0,1,1,59.0,186.0
3,1800000006366230,97,4,Services,1,0,0,0,1,57.0,126.0
4,1800000006366570,143,4,Services,1,1,0,0,1,36.0,197.0

In [26]:
demographics["Job_Type"] = le.fit_transform(demographics["Job_Type"])

In [27]:
demographics.isnull().sum()

Customer_ID       0
Nationality       0
Income_Range      0
Job_Type          0
Marital_Status    0
Gender            0
State             0
Language          0
Loyalty_Status    0
Age               0
Points            0
dtype: int64

In [28]:
from sklearn.metrics.pairwise import cosine_similarity

In [29]:
similarity = cosine_similarity(demographics[0:1], demographics)

In [34]:
customers = demographics.Customer_ID.unique()

In [35]:
customers

array([1800000006365760, 1800000006365820, 1800000006366060, ...,
       1800000284710670, 1800000284712570, 1800000288858110], dtype=int64)

In [36]:
demographics.set_index("Customer_ID", inplace = True)

In [38]:
demographics.head()

,Nationality,Income_Range,Job_Type,Marital_Status,Gender,State,Language,Loyalty_Status,Age,Points
Customer_ID,,,,,,,,,,
1800000006365760,88,4,14,1,1,0,1,0,59.0,814.0
1800000006365820,206,4,14,1,0,0,0,1,36.0,212.0
1800000006366060,182,4,14,1,1,0,1,1,59.0,186.0
1800000006366230,97,4,14,1,0,0,0,1,57.0,126.0
1800000006366570,143,4,14,1,1,0,0,1,36.0,197.0

In [48]:
demographics.loc[1800000006366230]

Nationality        97.0
Income_Range        4.0
Job_Type           14.0
Marital_Status      1.0
Gender              0.0
State               0.0
Language            0.0
Loyalty_Status      1.0
Age                57.0
Points            126.0
Name: 1800000006366230, dtype: float64

In [32]:
demographics.shape

(100000, 11)

In [53]:
np.array(demographics)

array([[8.800e+01, 4.000e+00, 1.400e+01, ..., 0.000e+00, 5.900e+01,
        8.140e+02],
       [2.060e+02, 4.000e+00, 1.400e+01, ..., 1.000e+00, 3.600e+01,
        2.120e+02],
       [1.820e+02, 4.000e+00, 1.400e+01, ..., 1.000e+00, 5.900e+01,
        1.860e+02],
       ...,
       [1.450e+02, 6.000e+00, 1.800e+01, ..., 1.000e+00, 4.600e+01,
        1.792e+03],
       [8.800e+01, 6.000e+00, 1.800e+01, ..., 0.000e+00, 4.600e+01,
        6.570e+02],
       [2.060e+02, 6.000e+00, 1.800e+01, ..., 1.000e+00, 4.500e+01,
        4.510e+02]])

In [56]:
cosine_similarity(demographics.loc[1800000006366060], demographics.loc[1800000006366570])

ValueError: Expected 2D array, got 1D array instead:
array=[182.   4.  14.   1.   1.   0.   1.   1.  59. 186.].
Reshape your data either using array.reshape(-1, 1) if your data has a single feature or array.reshape(1, -1) if it contains a single sample.

In [57]:
def cos_sim(a, b):
	"""Takes 2 vectors a, b and returns the cosine similarity according 
	to the definition of the dot product
	"""
	dot_product = np.dot(a, b)
	norm_a = np.linalg.norm(a)
	norm_b = np.linalg.norm(b)
	return dot_product / (norm_a * norm_b)

In [58]:
cos_sim(demographics.loc[1800000006366060], demographics.loc[1800000006366570])

0.9867753178238403

In [63]:
def calculate_similarity(customer):
    sim = {}
    for other in customers:
        sim[other] = cos_sim(demographics.loc[customer], demographics.loc[other])
    return(similarity)

In [ ]:
calculate_similarity(1800000006366230)

In [40]:
transaction = pd.read_excel("./Data/Customer_Transaction.xlsx")
transaction.head()

,Territory,Business,Year,Week,Store_Code,City_Name,Store_Type,Transaction_Type,Return_Reason,Customer_ID,Invoices,Item_Count,Revenue,Discount,Units_Sold
0,United Arab Emirates,Max,2010,0,60065,Dubai,Stand alone,Return,Size Problem,1800000058056860,1,3,-169.0,0.0,-3
1,United Arab Emirates,Max,2016,0,60053,NaN,NaN,Purchase,NaN,1800000020917140,1,1,0.0,0.0,0
2,United Arab Emirates,Max,2016,0,60053,NaN,NaN,Purchase,NaN,1800000021265010,1,1,0.0,0.0,0
3,United Arab Emirates,Max,2016,0,60053,NaN,NaN,Purchase,NaN,1800000025693950,1,4,0.0,0.0,0
4,United Arab Emirates,Max,2016,0,60053,NaN,NaN,Purchase,NaN,1800000044104620,1,1,0.0,0.0,0

In [41]:
store_master = pd.read_excel("./Data/Store_Master.xlsx")

In [42]:
test_set = pd.read_excel("./Data/Test_Set.xlsx")

In [43]:
# demographics.to_csv("./Customer_Demographics.csv", index=False)
# transaction.to_csv("./Customer_Transaction.csv", index=False)
# store_master.to_csv("./Store_Master.csv", index=False)
# test_set.to_csv("./Test_Set.csv", index=False)

In [44]:
transaction.shape

(544649, 15)

In [45]:
store = pd.read_csv("./Store_Master.csv")

In [46]:
store.head()

,Territory,Business,Region,Region_Code,Store_Code,Store_Name,Mall_Name,Store_Format,Sales_Per_Day,Store_Launch_Date,Train_Test_Store,Geo_Field,Store_Size_Sq_Ft,Customer_Count,Total_Revenue
0,United Arab Emirates,Max,MX - Abu Dhabi,602,60077,Max Zayed City Mall,City Mall - Abu Dhabi-Uae,NaN,544.074849,2011-11-02,Train,"25.618167, 53.441646",4852.220341,22237.0,1.131676e+07
1,United Arab Emirates,Max,MX - Sharjah,606,60073,Max Safeer Mall,Safeer Mall Sharjah-Uae,NaN,1251.656549,2009-08-21,Train,"25.309997, 55.378550",13789.949661,88372.0,2.603446e+07
2,United Arab Emirates,Max,MX - Dubai,601,60065,Max Gardens,Ibn Battuta Mall-Uae,NaN,3319.885702,2005-04-15,Train,"25.044684, 55.120275",15609.687991,188836.0,6.905362e+07
3,United Arab Emirates,Max,MX - Dubai,601,60219,MX -Dubai Festival City,Dubai Festival City-Uae,Stand Alone Stores,1211.477261,2014-06-12,Train,"25.218486, 55.359313",6845.497058,96733.0,2.519873e+07
4,United Arab Emirates,Max,MX - Ras Al Khaimah,605,60071,Max Rak,STANDALONE,NaN,2221.872874,2006-03-20,Train,NaN,12385.047461,70456.0,4.621496e+07

In [47]:
# transaction[transaction['Store_Code'] == 60065]

In [48]:
transaction[transaction['Customer_ID'] == 1800000058056860].shape

(24, 15)

In [49]:
# transaction.groupby(['Store_Code'])['Customer_ID'].count()

In [50]:
# res = pd.DataFrame(transaction.groupby(['Customer_ID','Store_Code']).count().unstack())

In [51]:
# transaction.groupby(['Customer_ID','Store_Code'])['Territory'].count()

In [52]:
res = pd.DataFrame(transaction.groupby(['Customer_ID','Store_Code']).count())

In [53]:
res.head(20)

                             Territory  Business  Year  Week  City_Name  \
Customer_ID      Store_Code
1800000006365760 60067               4         4     4     4          4
1800000006365820 60054               1         1     1     1          1
1800000006366060 60066               1         1     1     1          1
                 60069               1         1     1     1          1
                 60079               2         2     2     2          2
                 60233               2         2     2     2          2
1800000006366230 60053               1         1     1     1          1
                 60067               2         2     2     2          2
                 60069               2         2     2     2          2
                 60233               1         1     1     1          1
1800000006366570 60053              10        10    10    10         10
1800000006366750 60079              21        21    21    21         21
                 60233               1         1     1     1          1
1800000006366910 60053               2         2     2     2          2
1800000006366930 60058               4         4     4     4          4
1800000006367140 60054               5         5     5     5          5
                 60069               1         1     1     1          1
1800000006367270 60069               2         2     2     2          2
1800000006367330 60058               1         1     1     1          1
1800000006367900 60079               9         9     9     9          8

                             Store_Type  Transaction_Type  Return_Reason  \
Customer_ID      Store_Code
1800000006365760 60067                4                 4              0
1800000006365820 60054                1                 1              0
1800000006366060 60066                1                 1              0
                 60069                1                 1              0
                 60079                2                 2              0
                 60233                2                 2              0
1800000006366230 60053                1                 1              0
                 60067                2                 2              0
                 60069                2                 2              0
                 60233                1                 1              0
1800000006366570 60053               10                10              1
1800000006366750 60079               21                21              1
                 60233                1                 1              0
1800000006366910 60053                2                 2              0
1800000006366930 60058                4                 4              1
1800000006367140 60054                5                 5              0
                 60069                1                 1              0
1800000006367270 60069                2                 2              1
1800000006367330 60058                1                 1              0
1800000006367900 60079                8                 9              1

                             Invoices  Item_Count  Revenue  Discount  \
Customer_ID      Store_Code
1800000006365760 60067              4           4        4         4
1800000006365820 60054              1           1        1         1
1800000006366060 60066              1           1        1         1
                 60069              1           1        1         1
                 60079              2           2        2         2
                 60233              2           2        2         2
1800000006366230 60053              1           1        1         1
                 60067              2           2        2         2
                 60069              2           2        2         2
                 60233              1           1        1         1
1800000006366570 60053             10          10       10        10
1800000006366750 60079             21          21       21        21
                 60233              1           1        1         1
1800000006366910 60053              2           2        2         2
1800000006366930 60058              4           4        4         4
1800000006367140 60054              5           5        5         5
                 60069              1           1        1         1
1800000006367270 60069              2           2        2         2
1800000006367330 60058              1           1        1         1
1800000006367900 60079              9           9        9         9

                             Units_Sold
Customer_ID      Store_Code
1800000006365760 60067                4
1800000006365820 60054                1
1800000006366060 60066                1
                 60069                1
                 60079                2
                 60233                2
1800000006366230 60053                1
                 60067                2
                 60069                2
                 60233                1
1800000006366570 60053               10
1800000006366750 60079               21
                 60233                1
1800000006366910 60053                2
1800000006366930 60058                4
1800000006367140 60054                5
                 60069                1
1800000006367270 60069                2
1800000006367330 60058                1
1800000006367900 60079                9

In [54]:
# res.columns

In [55]:
res.shape

(184288, 13)

In [51]:
len(res.columns)

32

In [52]:
res.loc[1800000006366570, 60053]

10.0

In [53]:
transaction.dtypes

Territory            object
Business             object
Year                  int64
Week                  int64
Store_Code            int64
City_Name            object
Store_Type           object
Transaction_Type     object
Return_Reason        object
Customer_ID           int64
Invoices              int64
Item_Count            int64
Revenue             float64
Discount            float64
Units_Sold            int64
dtype: object

In [54]:
store_master = pd.read_excel("./Data/Store_Master.xlsx")

In [55]:
store_master.head()

,Territory,Business,Region,Region_Code,Store_Code,Store_Name,Mall_Name,Store_Format,Sales_Per_Day,Store_Launch_Date,Train_Test_Store,Geo_Field,Store_Size_Sq_Ft,Customer_Count,Total_Revenue
0,United Arab Emirates,Max,MX - Abu Dhabi,602,60077,Max Zayed City Mall,City Mall - Abu Dhabi-Uae,NaN,544.074849,2011-11-02,Train,"25.618167, 53.441646",4852.220341,22237.0,1.131676e+07
1,United Arab Emirates,Max,MX - Sharjah,606,60073,Max Safeer Mall,Safeer Mall Sharjah-Uae,NaN,1251.656549,2009-08-21,Train,"25.309997, 55.378550",13789.949661,88372.0,2.603446e+07
2,United Arab Emirates,Max,MX - Dubai,601,60065,Max Gardens,Ibn Battuta Mall-Uae,NaN,3319.885702,2005-04-15,Train,"25.044684, 55.120275",15609.687991,188836.0,6.905362e+07
3,United Arab Emirates,Max,MX - Dubai,601,60219,MX -Dubai Festival City,Dubai Festival City-Uae,Stand Alone Stores,1211.477261,2014-06-12,Train,"25.218486, 55.359313",6845.497058,96733.0,2.519873e+07
4,United Arab Emirates,Max,MX - Ras Al Khaimah,605,60071,Max Rak,STANDALONE,NaN,2221.872874,2006-03-20,Train,NaN,12385.047461,70456.0,4.621496e+07

In [56]:
demographics.Customer_ID.nunique()

100000

In [57]:
store_master.Store_Code.nunique()

35

In [58]:
train_store = store_master[store_master["Train_Test_Store"] == "Train"]

In [59]:
test_store = store_master[store_master["Train_Test_Store"] == "Test"]

In [60]:
train_store.Store_Code.nunique()

31

In [61]:
storelist = train_store.Store_Code.unique()

In [62]:
custlist = demographics.Customer_ID.unique()

In [64]:
def no_transaction(Store_Code, Customer_ID):
    no = res.loc[Store_Code, Customer_ID]
    if no != 0:
        return no
    
# listdata = []
# for store in storelist:
#     for cust in custlist:
#         try:
#             dict = {'Store_Code': store, 'Customer_ID': cust, 'no_transaction': res.loc[cust, store] }
#             listdata.append(dict)
#         except KeyError:
#             print("key Error")
            
# print(listdata)
            
        
# new_data = pd.DataFrame(data)
# new_data.head()

In [68]:
store_master.shape

(35, 15)

In [69]:
store_master.Store_Code.value_counts().shape

(35,)

In [70]:
store_master[store_master["Store_Code"] == 60065 ]

,Territory,Business,Region,Region_Code,Store_Code,Store_Name,Mall_Name,Store_Format,Sales_Per_Day,Store_Launch_Date,Train_Test_Store,Geo_Field,Store_Size_Sq_Ft,Customer_Count,Total_Revenue
2,United Arab Emirates,Max,MX - Dubai,601,60065,Max Gardens,Ibn Battuta Mall-Uae,NaN,3319.885702,2005-04-15,Train,"25.044684, 55.120275",15609.687991,188836.0,69053622.61

In [ ]:
for

In [36]:
store_master.dtypes

Territory                    object
Business                     object
Region                       object
Region_Code                   int64
Store_Code                    int64
Store_Name                   object
Mall_Name                    object
Store_Format                 object
Sales_Per_Day               float64
Store_Launch_Date    datetime64[ns]
Train_Test_Store             object
Geo_Field                    object
Store_Size_Sq_Ft            float64
Customer_Count              float64
Total_Revenue               float64
dtype: object

In [7]:
test_set = pd.read_excel("./Data/Test_Set.xlsx")
test_set.head()

        Customer_ID  Store_Code
0  1800000006365760       60298
1  1800000006365760       60299
2  1800000006365760       60300
3  1800000006365760       60301
4  1800000006365820       60298

In [13]:
test_set.Store_Code.value_counts()

60298    100000
60299    100000
60300    100000
60301    100000
Name: Store_Code, dtype: int64

In [14]:
test_set.shape

(400000, 2)

In [38]:
demographics.dtypes

Customer_ID           int64
Territory            object
Nationality          object
Income_Range         object
Job_Type             object
Marital_Status       object
Gender               object
State                object
Language             object
Loyalty_Status       object
Birth_date           object
Age                 float64
Points              float64
First_txn_dt         object
Last_accr_txn_dt     object
Last_rdm_txn_dt      object
dtype: object

In [39]:
transaction.dtypes

Territory            object
Business             object
Year                  int64
Week                  int64
Store_Code            int64
City_Name            object
Store_Type           object
Transaction_Type     object
Return_Reason        object
Customer_ID           int64
Invoices              int64
Item_Count            int64
Revenue             float64
Discount            float64
Units_Sold            int64
dtype: object

In [40]:
store_master.dtypes

Territory                    object
Business                     object
Region                       object
Region_Code                   int64
Store_Code                    int64
Store_Name                   object
Mall_Name                    object
Store_Format                 object
Sales_Per_Day               float64
Store_Launch_Date    datetime64[ns]
Train_Test_Store             object
Geo_Field                    object
Store_Size_Sq_Ft            float64
Customer_Count              float64
Total_Revenue               float64
dtype: object